app/views/tasks/_show_task.html.erb

SELECT "categories".* FROM "categories"
---
  <div class="tab-content">
    <% Category.all.each_with_index do  |category, index|%>

SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1  [["category_id", 1]]
---
      <ul>
        <% category.tasks.each do |task|  %>