app/views/tasks/destroy.js.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
console.log("li#task-<%=@task.id.to_i%>")
$('.tab-content').find('div').eq(<%= @task.category.id.to_i - 1 %>).find('ul').find('li#task-<%=@task.id.to_i%>').remove();